[NoCoverage] BooleanLiteral
Line_Bus/src/components/ForgotPassword.js:10:44
     const emailRef = useRef();
     const [error, setError] = useState('');
     const [message, setMessage] = useState('');
-    const [loading, setLoading] = useState(false);
+    const [loading, setLoading] = useState(true);
     const { resetPassword } = useAuth();
 

[NoCoverage] BlockStatement
Line_Bus/src/components/ForgotPassword.js:13:36
     const [loading, setLoading] = useState(false);
     const { resetPassword } = useAuth();
 
-    async function handleSubmit(e) {
-        e.preventDefault();
-
-        try {
-            setMessage('');
-            setError('');
-            setLoading(true);
-            await resetPassword(emailRef.current.value);
-            setMessage('Check your inbox for further instructions');
-        } catch (e) {
-            console.log(e);
-            setError('Failed to reset password');
-        }
-
-        setLoading(false);
-    }
+    async function handleSubmit(e) {}
 
     return (

[NoCoverage] BlockStatement
Line_Bus/src/components/ForgotPassword.js:16:13
     async function handleSubmit(e) {
         e.preventDefault();
 
-        try {
-            setMessage('');
-            setError('');
-            setLoading(true);
-            await resetPassword(emailRef.current.value);
-            setMessage('Check your inbox for further instructions');
-        } catch (e) {
+        try {} catch (e) {
             console.log(e);
             setError('Failed to reset password');

[NoCoverage] StringLiteral
Line_Bus/src/components/ForgotPassword.js:21:24
             setError('');
             setLoading(true);
             await resetPassword(emailRef.current.value);
-            setMessage('Check your inbox for further instructions');
+            setMessage("");
         } catch (e) {
             console.log(e);

[NoCoverage] BlockStatement
Line_Bus/src/components/ForgotPassword.js:22:21
             setLoading(true);
             await resetPassword(emailRef.current.value);
             setMessage('Check your inbox for further instructions');
-        } catch (e) {
-            console.log(e);
-            setError('Failed to reset password');
-        }
+        } catch (e) {}
 
         setLoading(false);

[NoCoverage] StringLiteral
Line_Bus/src/components/ForgotPassword.js:24:22
             setMessage('Check your inbox for further instructions');
         } catch (e) {
             console.log(e);
-            setError('Failed to reset password');
+            setError("");
         }
 

[NoCoverage] ConditionalExpression
Line_Bus/src/components/ForgotPassword.js:35:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Password Reset</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {true}
                     {message && <Alert variant="success">{message}</Alert>}
                     <Form onSubmit={handleSubmit}>

[NoCoverage] LogicalOperator
Line_Bus/src/components/ForgotPassword.js:35:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Password Reset</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {error || <Alert variant="danger">{error}</Alert>}
                     {message && <Alert variant="success">{message}</Alert>}
                     <Form onSubmit={handleSubmit}>

[NoCoverage] LogicalOperator
Line_Bus/src/components/ForgotPassword.js:36:22
                 <Card.Body>
                     <h2 className="text-center mb-4">Password Reset</h2>
                     {error && <Alert variant="danger">{error}</Alert>}
-                    {message && <Alert variant="success">{message}</Alert>}
+                    {message || <Alert variant="success">{message}</Alert>}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">

[NoCoverage] ConditionalExpression
Line_Bus/src/components/ForgotPassword.js:36:22
                 <Card.Body>
                     <h2 className="text-center mb-4">Password Reset</h2>
                     {error && <Alert variant="danger">{error}</Alert>}
-                    {message && <Alert variant="success">{message}</Alert>}
+                    {true}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">
