[NoCoverage] BlockStatement
Line_Bus/src/components/Login.js:15:30
     const [message, setMessage] = useState('');
     const [loading, setLoading] = useState(false);
 
-    function handleSubmit(e) {
-        e.preventDefault();
-
-        try {
-            setError('');
-            setLoading(true);
-            login(emailRef.current.value, passwordRef.current.value);
-            history.push('/');
-        } catch (e) {
-            console.log(e);
-            setError('Failed to sign in');
-        }
-
-        setLoading(false);
-    }
+    function handleSubmit(e) {}
 
     return (

[NoCoverage] BlockStatement
Line_Bus/src/components/Login.js:18:13
     function handleSubmit(e) {
         e.preventDefault();
 
-        try {
-            setError('');
-            setLoading(true);
-            login(emailRef.current.value, passwordRef.current.value);
-            history.push('/');
-        } catch (e) {
+        try {} catch (e) {
             console.log(e);
             setError('Failed to sign in');

[NoCoverage] StringLiteral
Line_Bus/src/components/Login.js:22:26
             setError('');
             setLoading(true);
             login(emailRef.current.value, passwordRef.current.value);
-            history.push('/');
+            history.push("");
         } catch (e) {
             console.log(e);

[NoCoverage] BlockStatement
Line_Bus/src/components/Login.js:23:21
             setLoading(true);
             login(emailRef.current.value, passwordRef.current.value);
             history.push('/');
-        } catch (e) {
-            console.log(e);
-            setError('Failed to sign in');
-        }
+        } catch (e) {}
 
         setLoading(false);

[NoCoverage] ConditionalExpression
Line_Bus/src/components/Login.js:36:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Log In</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {true}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">

[NoCoverage] LogicalOperator
Line_Bus/src/components/Login.js:36:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Log In</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {error || <Alert variant="danger">{error}</Alert>}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">
