[NoCoverage] BlockStatement
Line_Bus/src/components/Dashboard.js:11:35
     const { currentUser, logout } = useAuth();
     const history = useHistory();
 
-    async function handleLogout() {
-        setError('');
-
-        try {
-            await logout();
-            history.push('/login');
-        } catch (e) {
-            setError("Failed to log out");
-        }
-    }
+    async function handleLogout() {}
 
     return (

[NoCoverage] BlockStatement
Line_Bus/src/components/Dashboard.js:14:13
     async function handleLogout() {
         setError('');
 
-        try {
-            await logout();
-            history.push('/login');
-        } catch (e) {
+        try {} catch (e) {
             setError("Failed to log out");
         }

[NoCoverage] BlockStatement
Line_Bus/src/components/Dashboard.js:17:21
         try {
             await logout();
             history.push('/login');
-        } catch (e) {
-            setError("Failed to log out");
-        }
+        } catch (e) {}
     }
 

[NoCoverage] ConditionalExpression
Line_Bus/src/components/Dashboard.js:27:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Profile</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {false}
                     <strong>Email: </strong>{currentUser.email}
                     <Link to="/update-profile" className="btn btn-primary w-100 mt-3">

[NoCoverage] ConditionalExpression
Line_Bus/src/components/Dashboard.js:27:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Profile</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {true}
                     <strong>Email: </strong>{currentUser.email}
                     <Link to="/update-profile" className="btn btn-primary w-100 mt-3">
