[NoCoverage] BlockStatement
Line_Bus/src/components/PrivateRoute.js:5:73
 import { Redirect, Route } from 'react-router-dom';
 import { useAuth } from '../contexts/AuthContext';
 
-export default function PrivateRoute({ component: Component, ...rest }) {
-    const { currentUser } = useAuth();
-
-    return (
-        <Route
-            {...rest}
-            render={props => {
-                return currentUser ? <Component {...props} /> : <Redirect to="/login" />
-            }}
-        >
-
-        </Route>
-    )
-}
+export default function PrivateRoute({ component: Component, ...rest }) {}
 

[NoCoverage] BlockStatement
Line_Bus/src/components/PrivateRoute.js:11:30
     return (
         <Route
             {...rest}
-            render={props => {
-                return currentUser ? <Component {...props} /> : <Redirect to="/login" />
-            }}
+            render={props => {}}
         >
 
