[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:6:27
 
 const AuthContext = React.createContext();
 
-export function useAuth() {
-    return useContext(AuthContext);
-}
+export function useAuth() {}
 
 export function AuthProvider({ children }) {

[NoCoverage] BooleanLiteral
Line_Bus/src/contexts/AuthContext.js:12:44
 
 export function AuthProvider({ children }) {
     const [currentUser, setCurrentUser] = useState()
-    const [loading, setLoading] = useState(true);
+    const [loading, setLoading] = useState(false);
 
     function signup(email, password) {

[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:14:38
     const [currentUser, setCurrentUser] = useState()
     const [loading, setLoading] = useState(true);
 
-    function signup(email, password) {
-        return auth.createUserWithEmailAndPassword(email, password);
-    }
+    function signup(email, password) {}
 
     function login(email, password) {

[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:18:37
         return auth.createUserWithEmailAndPassword(email, password);
     }
 
-    function login(email, password) {
-        return auth.signInWithEmailAndPassword(email, password);
-    }
+    function login(email, password) {}
 
     function logout() {

[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:22:23
         return auth.signInWithEmailAndPassword(email, password);
     }
 
-    function logout() {
-        return auth.signOut();
-    }
+    function logout() {}
 
     function resetPassword(email) {

[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:26:35
         return auth.signOut();
     }
 
-    function resetPassword(email) {
-        return auth.sendPasswordResetEmail(email);
-    }
+    function resetPassword(email) {}
 
     function updateEmail(email) {

[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:30:33
         return auth.sendPasswordResetEmail(email);
     }
 
-    function updateEmail(email) {
-        return auth.currentUser.updateEmail(email);
-    }
+    function updateEmail(email) {}
 
     function updadePassword(password) {

[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:34:39
         return auth.currentUser.updateEmail(email);
     }
 
-    function updadePassword(password) {
-        return auth.currentUser.updatePassword(password);
-    }
+    function updadePassword(password) {}
 
     useEffect(() => {

[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:38:21
         return auth.currentUser.updatePassword(password);
     }
 
-    useEffect(() => {
-        const unsubscribe = auth.onAuthStateChanged(user => {
-            setCurrentUser(user);
-            setLoading(false);
-        });
-
-        return unsubscribe;
-    }, []);
+    useEffect(() => {}, []);
 
     const value = {

[NoCoverage] BlockStatement
Line_Bus/src/contexts/AuthContext.js:39:61
     }
 
     useEffect(() => {
-        const unsubscribe = auth.onAuthStateChanged(user => {
-            setCurrentUser(user);
-            setLoading(false);
-        });
+        const unsubscribe = auth.onAuthStateChanged(user => {});
 
         return unsubscribe;

[NoCoverage] BooleanLiteral
Line_Bus/src/contexts/AuthContext.js:41:24
     useEffect(() => {
         const unsubscribe = auth.onAuthStateChanged(user => {
             setCurrentUser(user);
-            setLoading(false);
+            setLoading(true);
         });
 

[NoCoverage] ObjectLiteral
Line_Bus/src/contexts/AuthContext.js:47:19
         return unsubscribe;
     }, []);
 
-    const value = {
-        currentUser,
-        login,
-        signup,
-        logout,
-        resetPassword,
-        updateEmail,
-        updadePassword
-    }
+    const value = {}
 
     return (

[NoCoverage] ConditionalExpression
Line_Bus/src/contexts/AuthContext.js:59:15
 
     return (
         <AuthContext.Provider value={value} >
-            { !loading && children}
+            { false}
         </AuthContext.Provider>
     )

[NoCoverage] ConditionalExpression
Line_Bus/src/contexts/AuthContext.js:59:15
 
     return (
         <AuthContext.Provider value={value} >
-            { !loading && children}
+            { true}
         </AuthContext.Provider>
     )
