[NoCoverage] ConditionalExpression
line-bus/src/components/ForgotPassword.js:35:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Password Reset</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {false}
                     {message && <Alert variant="success">{message}</Alert>}
                     <Form onSubmit={handleSubmit}>

[NoCoverage] ConditionalExpression
line-bus/src/components/ForgotPassword.js:36:22
                 <Card.Body>
                     <h2 className="text-center mb-4">Password Reset</h2>
                     {error && <Alert variant="danger">{error}</Alert>}
-                    {message && <Alert variant="success">{message}</Alert>}
+                    {false}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">
