[NoCoverage] BooleanLiteral
Line_Bus/src/components/Signup.js:12:44
     const passwordConfirmRef = useRef();
     const { signup } = useAuth();
     const [error, setError] = useState('');
-    const [loading, setLoading] = useState(false);
+    const [loading, setLoading] = useState(true);
     const history = useHistory();
 

[NoCoverage] BlockStatement
Line_Bus/src/components/Signup.js:15:30
     const [loading, setLoading] = useState(false);
     const history = useHistory();
 
-    function handleSubmit(e) {
-        e.preventDefault();
-
-        if (passwordRef.current.value !== passwordConfirmRef.current.value) {
-            return setError('Passwords do not match');
-        }
-
-        try {
-            setError('');
-            setLoading(true);
-            signup(emailRef.current.value, passwordRef.current.value);
-            history.push("/");
-        } catch (error) {
-            console.log(error);
-            setError('Failed to create an account');
-        }
-
-        setLoading(false);
-    }
+    function handleSubmit(e) {}
 
     return (

[NoCoverage] BlockStatement
Line_Bus/src/components/Signup.js:18:77
     function handleSubmit(e) {
         e.preventDefault();
 
-        if (passwordRef.current.value !== passwordConfirmRef.current.value) {
-            return setError('Passwords do not match');
-        }
+        if (passwordRef.current.value !== passwordConfirmRef.current.value) {}
 
         try {

[NoCoverage] ConditionalExpression
Line_Bus/src/components/Signup.js:18:13
     function handleSubmit(e) {
         e.preventDefault();
 
-        if (passwordRef.current.value !== passwordConfirmRef.current.value) {
+        if (true) {
             return setError('Passwords do not match');
         }

[NoCoverage] StringLiteral
Line_Bus/src/components/Signup.js:19:29
         e.preventDefault();
 
         if (passwordRef.current.value !== passwordConfirmRef.current.value) {
-            return setError('Passwords do not match');
+            return setError("");
         }
 

[NoCoverage] BlockStatement
Line_Bus/src/components/Signup.js:22:13
             return setError('Passwords do not match');
         }
 
-        try {
-            setError('');
-            setLoading(true);
-            signup(emailRef.current.value, passwordRef.current.value);
-            history.push("/");
-        } catch (error) {
+        try {} catch (error) {
             console.log(error);
             setError('Failed to create an account');

[NoCoverage] BooleanLiteral
Line_Bus/src/components/Signup.js:24:24
 
         try {
             setError('');
-            setLoading(true);
+            setLoading(false);
             signup(emailRef.current.value, passwordRef.current.value);
             history.push("/");

[NoCoverage] BlockStatement
Line_Bus/src/components/Signup.js:27:25
             setLoading(true);
             signup(emailRef.current.value, passwordRef.current.value);
             history.push("/");
-        } catch (error) {
-            console.log(error);
-            setError('Failed to create an account');
-        }
+        } catch (error) {}
 
         setLoading(false);

[NoCoverage] BooleanLiteral
Line_Bus/src/components/Signup.js:32:20
             setError('Failed to create an account');
         }
 
-        setLoading(false);
+        setLoading(true);
     }
 

[NoCoverage] ConditionalExpression
Line_Bus/src/components/Signup.js:40:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Sign Up</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {false}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">

[NoCoverage] LogicalOperator
Line_Bus/src/components/Signup.js:40:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Sign Up</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {error || <Alert variant="danger">{error}</Alert>}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">
