[NoCoverage] StringLiteral
line-bus/src/components/Login.js:12:44
     const history = useHistory();
     const emailRef = useRef();
     const [error, setError] = useState('');
-    const [message, setMessage] = useState('');
+    const [message, setMessage] = useState("Stryker was here!");
     const [loading, setLoading] = useState(false);
 

[NoCoverage] StringLiteral
line-bus/src/components/Login.js:25:22
             history.push('/');
         } catch (e) {
             console.log(e);
-            setError('Failed to sign in');
+            setError("");
         }
 

[NoCoverage] ConditionalExpression
line-bus/src/components/Login.js:36:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Log In</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {false}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">
