[NoCoverage] StringLiteral
Line_Bus/src/components/UpdateProfile.js:11:40
     const passwordRef = useRef();
     const passwordConfirmRef = useRef();
     const { currentUser, updatePassword, updateEmail } = useAuth();
-    const [error, setError] = useState('');
+    const [error, setError] = useState("Stryker was here!");
     const [loading, setLoading] = useState(false);
     const history = useHistory();

[NoCoverage] ConditionalExpression
Line_Bus/src/components/UpdateProfile.js:18:13
     function handleSubmit(e) {
         e.preventDefault();
 
-        if (passwordRef.current.value !== passwordConfirmRef.current.value) {
+        if (false) {
             return setError('Passwords do not match');
         }

[NoCoverage] BooleanLiteral
Line_Bus/src/components/UpdateProfile.js:23:20
         }
 
         const promises = []
-        setLoading(true);
+        setLoading(false);
         setError("");
 

[NoCoverage] BlockStatement
Line_Bus/src/components/UpdateProfile.js:26:59
         setLoading(true);
         setError("");
 
-        if (emailRef.current.value !== currentUser.email) {
-            promises.push(updateEmail(emailRef.current.value));
-        }
+        if (emailRef.current.value !== currentUser.email) {}
         if (passwordRef.current.value) {
             promises.push(updatePassword(passwordRef.current.value));

[NoCoverage] EqualityOperator
Line_Bus/src/components/UpdateProfile.js:26:13
         setLoading(true);
         setError("");
 
-        if (emailRef.current.value !== currentUser.email) {
+        if (emailRef.current.value === currentUser.email) {
             promises.push(updateEmail(emailRef.current.value));
         }

[NoCoverage] BlockStatement
Line_Bus/src/components/UpdateProfile.js:29:40
         if (emailRef.current.value !== currentUser.email) {
             promises.push(updateEmail(emailRef.current.value));
         }
-        if (passwordRef.current.value) {
-            promises.push(updatePassword(passwordRef.current.value));
-        }
+        if (passwordRef.current.value) {}
 
         Promise.all(promises).then(() => {

[NoCoverage] ConditionalExpression
Line_Bus/src/components/UpdateProfile.js:29:13
         if (emailRef.current.value !== currentUser.email) {
             promises.push(updateEmail(emailRef.current.value));
         }
-        if (passwordRef.current.value) {
+        if (true) {
             promises.push(updatePassword(passwordRef.current.value));
         }

[NoCoverage] BlockStatement
Line_Bus/src/components/UpdateProfile.js:33:42
             promises.push(updatePassword(passwordRef.current.value));
         }
 
-        Promise.all(promises).then(() => {
-            history.push('/');
-        }).catch(() => {
+        Promise.all(promises).then(() => {}).catch(() => {
             setError('Failed to update account');
         }).finally(() => {

[NoCoverage] BlockStatement
Line_Bus/src/components/UpdateProfile.js:35:24
 
         Promise.all(promises).then(() => {
             history.push('/');
-        }).catch(() => {
-            setError('Failed to update account');
-        }).finally(() => {
+        }).catch(() => {}).finally(() => {
             setLoading(false);
         });

[NoCoverage] BlockStatement
Line_Bus/src/components/UpdateProfile.js:37:26
             history.push('/');
         }).catch(() => {
             setError('Failed to update account');
-        }).finally(() => {
-            setLoading(false);
-        });
+        }).finally(() => {});
     }
 

[NoCoverage] BooleanLiteral
Line_Bus/src/components/UpdateProfile.js:38:24
         }).catch(() => {
             setError('Failed to update account');
         }).finally(() => {
-            setLoading(false);
+            setLoading(true);
         });
     }

[NoCoverage] ConditionalExpression
Line_Bus/src/components/UpdateProfile.js:47:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Update Profile</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {false}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">

[NoCoverage] ConditionalExpression
Line_Bus/src/components/UpdateProfile.js:47:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Update Profile</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {true}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">
