[NoCoverage] ArrayDeclaration
line-bus/src/contexts/AuthContext.js:45:8
         });
 
         return unsubscribe;
-    }, []);
+    }, ["Stryker was here"]);
 
     const value = {

[NoCoverage] BooleanLiteral
line-bus/src/contexts/AuthContext.js:59:15
 
     return (
         <AuthContext.Provider value={value} >
-            { !loading && children}
+            { loading && children}
         </AuthContext.Provider>
     )
