[NoCoverage] StringLiteral
Testes/Line_Bus/src/index.js:8:27
 
 ReactDOM.render(
   <React.StrictMode><App /></React.StrictMode>,
-  document.getElementById("root")
+  document.getElementById("")
 )
 
