[Killed] BlockStatement
Line_Bus/src/backend/Bus.js:3:70
 
 class Bus {
-    constructor(modelo, quebrado, quant_assentos, quant_passageiros) {
-        this.modelo = modelo;
-        this.quebrado = quebrado;
-        this.quant_assentos = quant_assentos;
-        this.quant_passageiros = quant_passageiros;
-    }
+    constructor(modelo, quebrado, quant_assentos, quant_passageiros) {}
 
     superlotacao() {

[Killed] BlockStatement
Line_Bus/src/backend/Bus.js:10:20
         this.quant_passageiros = quant_passageiros;
     }
 
-    superlotacao() {
-        // retorna a quantida de pessoas em pé
-        let aux =  this.quant_passageiros - this.quant_assentos;
-        if (aux < 0) aux = 0;
-        return aux;
-    }
+    superlotacao() {}
 
     passageiro_Sai(quant) {

[Killed] ArithmeticOperator
Line_Bus/src/backend/Bus.js:12:20
 
     superlotacao() {
         // retorna a quantida de pessoas em pé
-        let aux =  this.quant_passageiros - this.quant_assentos;
+        let aux =  this.quant_passageiros + this.quant_assentos;
         if (aux < 0) aux = 0;
         return aux;

[Killed] ConditionalExpression
Line_Bus/src/backend/Bus.js:13:13
     superlotacao() {
         // retorna a quantida de pessoas em pé
         let aux =  this.quant_passageiros - this.quant_assentos;
-        if (aux < 0) aux = 0;
+        if (false) aux = 0;
         return aux;
     }

[Killed] ConditionalExpression
Line_Bus/src/backend/Bus.js:13:13
     superlotacao() {
         // retorna a quantida de pessoas em pé
         let aux =  this.quant_passageiros - this.quant_assentos;
-        if (aux < 0) aux = 0;
+        if (true) aux = 0;
         return aux;
     }

[Killed] BlockStatement
Line_Bus/src/backend/Bus.js:17:27
         return aux;
     }
 
-    passageiro_Sai(quant) {
-        this.quant_passageiros = this.quant_passageiros - quant;
-        if(this.quant_passageiros < 0) this.quant_passageiros = 0;
-    }
+    passageiro_Sai(quant) {}
     passageiro_Entra(quant) {
         this.quant_passageiros = this.quant_passageiros + quant;

[Killed] ArithmeticOperator
Line_Bus/src/backend/Bus.js:18:34
     }
 
     passageiro_Sai(quant) {
-        this.quant_passageiros = this.quant_passageiros - quant;
+        this.quant_passageiros = this.quant_passageiros + quant;
         if(this.quant_passageiros < 0) this.quant_passageiros = 0;
     }

[Killed] ConditionalExpression
Line_Bus/src/backend/Bus.js:19:12
 
     passageiro_Sai(quant) {
         this.quant_passageiros = this.quant_passageiros - quant;
-        if(this.quant_passageiros < 0) this.quant_passageiros = 0;
+        if(true) this.quant_passageiros = 0;
     }
     passageiro_Entra(quant) {

[Killed] EqualityOperator
Line_Bus/src/backend/Bus.js:19:12
 
     passageiro_Sai(quant) {
         this.quant_passageiros = this.quant_passageiros - quant;
-        if(this.quant_passageiros < 0) this.quant_passageiros = 0;
+        if(this.quant_passageiros >= 0) this.quant_passageiros = 0;
     }
     passageiro_Entra(quant) {

[Killed] BlockStatement
Line_Bus/src/backend/Bus.js:21:29
         this.quant_passageiros = this.quant_passageiros - quant;
         if(this.quant_passageiros < 0) this.quant_passageiros = 0;
     }
-    passageiro_Entra(quant) {
-        this.quant_passageiros = this.quant_passageiros + quant;
-    }
+    passageiro_Entra(quant) {}
 }
 module.exports = Bus;

[Killed] ArithmeticOperator
Line_Bus/src/backend/Bus.js:22:34
         if(this.quant_passageiros < 0) this.quant_passageiros = 0;
     }
     passageiro_Entra(quant) {
-        this.quant_passageiros = this.quant_passageiros + quant;
+        this.quant_passageiros = this.quant_passageiros - quant;
     }
 }
