[Survived] BlockStatement
Line_Bus/src/backend/Rota.js:4:19
 const Bus = require('../backend/Bus');
 
 class Rota {
-    constructor() {
-        this.onibus = null;
-    }
+    constructor() {}
 
     gerarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {

[Killed] BlockStatement
Line_Bus/src/backend/Rota.js:8:70
         this.onibus = null;
     }
 
-    gerarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
-        // rota.gerarOnibus('onibus', false, 15, 0);
-        if (!this.checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros)) return null;
-        return new Bus(modelo, quebrado, quant_assentos, quant_passageiros);
-    }
+    gerarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {}
 
     checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {

[Killed] BooleanLiteral
Line_Bus/src/backend/Rota.js:10:13
 
     gerarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
         // rota.gerarOnibus('onibus', false, 15, 0);
-        if (!this.checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros)) return null;
+        if (this.checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros)) return null;
         return new Bus(modelo, quebrado, quant_assentos, quant_passageiros);
     }

[Killed] ConditionalExpression
Line_Bus/src/backend/Rota.js:10:13
 
     gerarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
         // rota.gerarOnibus('onibus', false, 15, 0);
-        if (!this.checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros)) return null;
+        if (true) return null;
         return new Bus(modelo, quebrado, quant_assentos, quant_passageiros);
     }

[Killed] BlockStatement
Line_Bus/src/backend/Rota.js:14:71
         return new Bus(modelo, quebrado, quant_assentos, quant_passageiros);
     }
 
-    checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
-        return (typeof modelo === 'string' && typeof quebrado === 'boolean' && quant_assentos > 0 && quant_passageiros >= 0);
-    }
+    checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {}
 
 }

[Killed] EqualityOperator
Line_Bus/src/backend/Rota.js:15:47
     }
 
     checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
-        return (typeof modelo === 'string' && typeof quebrado === 'boolean' && quant_assentos > 0 && quant_passageiros >= 0);
+        return (typeof modelo === 'string' && typeof quebrado !== 'boolean' && quant_assentos > 0 && quant_passageiros >= 0);
     }
 

[Killed] ConditionalExpression
Line_Bus/src/backend/Rota.js:15:17
     }
 
     checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
-        return (typeof modelo === 'string' && typeof quebrado === 'boolean' && quant_assentos > 0 && quant_passageiros >= 0);
+        return (true);
     }
 
