[NoCoverage] StringLiteral
line-bus/src/components/Dashboard.js:12:18
     const history = useHistory();
 
     async function handleLogout() {
-        setError('');
+        setError("Stryker was here!");
 
         try {

[NoCoverage] StringLiteral
line-bus/src/components/Dashboard.js:16:26
 
         try {
             await logout();
-            history.push('/login');
+            history.push("");
         } catch (e) {
             setError("Failed to log out");
