[NoCoverage] StringLiteral
line-bus/src/components/Signup.js:11:40
     const passwordRef = useRef();
     const passwordConfirmRef = useRef();
     const { signup } = useAuth();
-    const [error, setError] = useState('');
+    const [error, setError] = useState("Stryker was here!");
     const [loading, setLoading] = useState(false);
     const history = useHistory();

[NoCoverage] EqualityOperator
line-bus/src/components/Signup.js:18:13
     function handleSubmit(e) {
         e.preventDefault();
 
-        if (passwordRef.current.value !== passwordConfirmRef.current.value) {
+        if (passwordRef.current.value === passwordConfirmRef.current.value) {
             return setError('Passwords do not match');
         }
