[NoCoverage] ArrayDeclaration
line-bus/src/components/UpdateProfile.js:22:26
             return setError('Passwords do not match');
         }
 
-        const promises = []
+        const promises = ["Stryker was here"]
         setLoading(true);
         setError("");

[NoCoverage] ConditionalExpression
line-bus/src/components/UpdateProfile.js:26:13
         setLoading(true);
         setError("");
 
-        if (emailRef.current.value !== currentUser.email) {
+        if (false) {
             promises.push(updateEmail(emailRef.current.value));
         }

[NoCoverage] ConditionalExpression
line-bus/src/components/UpdateProfile.js:29:13
         if (emailRef.current.value !== currentUser.email) {
             promises.push(updateEmail(emailRef.current.value));
         }
-        if (passwordRef.current.value) {
+        if (false) {
             promises.push(updatePassword(passwordRef.current.value));
         }

[NoCoverage] StringLiteral
line-bus/src/components/UpdateProfile.js:36:22
         Promise.all(promises).then(() => {
             history.push('/');
         }).catch(() => {
-            setError('Failed to update account');
+            setError("");
         }).finally(() => {
             setLoading(false);

[NoCoverage] LogicalOperator
line-bus/src/components/UpdateProfile.js:47:22
             <Card>
                 <Card.Body>
                     <h2 className="text-center mb-4">Update Profile</h2>
-                    {error && <Alert variant="danger">{error}</Alert>}
+                    {error || <Alert variant="danger">{error}</Alert>}
                     <Form onSubmit={handleSubmit}>
                         <Form.Group id="email">
