[Killed] EqualityOperator
line-bus/src/backend/Bus.js:13:13
     superlotacao() {
         // retorna a quantida de pessoas em pé
         let aux =  this.quant_passageiros - this.quant_assentos;
-        if (aux < 0) aux = 0;
+        if (aux >= 0) aux = 0;
         return aux;
     }
