[Killed] ConditionalExpression
line-bus/src/backend/Rota.js:10:13
 
     gerarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
         // rota.gerarOnibus('onibus', false, 15, 0);
-        if (!this.checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros)) return null;
+        if (false) return null;
         return new Bus(modelo, quebrado, quant_assentos, quant_passageiros);
     }

[Killed] EqualityOperator
line-bus/src/backend/Rota.js:15:17
     }
 
     checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
-        return (typeof modelo === 'string' && typeof quebrado === 'boolean' && quant_assentos > 0 && quant_passageiros >= 0);
+        return (typeof modelo !== 'string' && typeof quebrado === 'boolean' && quant_assentos > 0 && quant_passageiros >= 0);
     }
 

[Killed] ConditionalExpression
line-bus/src/backend/Rota.js:15:80
     }
 
     checarOnibus(modelo, quebrado, quant_assentos, quant_passageiros) {
-        return (typeof modelo === 'string' && typeof quebrado === 'boolean' && quant_assentos > 0 && quant_passageiros >= 0);
+        return (typeof modelo === 'string' && typeof quebrado === 'boolean' && false && quant_passageiros >= 0);
     }
 
